000010  IDENTIFICATION DIVISION.
000020    PROGRAM-ID. MOVE_TRUNCATE.
000030    AUTHOR. Dan Ruscoe.
000040  DATA DIVISION.
000050    WORKING-STORAGE SECTION.
000060      01 STRING_VALUE PIC A(15) VALUE SPACES.
000070  PROCEDURE DIVISION.
000080    MOVE "This fits" TO STRING_VALUE.
000090    DISPLAY STRING_VALUE.
000100    MOVE "This does not fit" TO STRING_VALUE.
000110    DISPLAY STRING_VALUE.
000120    STOP RUN.
