000010  IDENTIFICATION DIVISION.
000020    PROGRAM-ID. MULTIPLY_INPUT.
000030    AUTHOR. Dan Ruscoe.
000040  DATA DIVISION.
000050    WORKING-STORAGE SECTION.
000060      01 NUM1 PIC 9(3).
000070      01 NUM2 PIC 9(3).
000080      01 NUM3 PIC 9(3).
000090  PROCEDURE DIVISION.
000100    DISPLAY "First number: ".
000110    ACCEPT NUM1.
000120    DISPLAY "Second number: ".
000130    ACCEPT NUM2.
000140    MULTIPLY NUM1 BY NUM2 GIVING NUM3
000150    DISPLAY NUM1 " * " NUM2 " = " NUM3.
000160    STOP RUN.
