000010  IDENTIFICATION DIVISION.
000020    PROGRAM-ID. WRITEFILE.
000030    AUTHOR. Dan Ruscoe.
000040  ENVIRONMENT DIVISION.
000050    INPUT-OUTPUT SECTION.
000060      FILE-CONTROL.
000070        SELECT DATA-FILE ASSIGN TO "data/output.txt"
000080          ORGANIZATION IS SEQUENTIAL
000090          ACCESS IS SEQUENTIAL.
000100  DATA DIVISION.
000110    FILE SECTION.
000120      FD DATA-FILE.
000130        01 IN-RECORD.
000140          05 FRUIT    PIC X(8).
000150  PROCEDURE DIVISION.
000160      OPEN EXTEND DATA-FILE.
000170      MOVE 'ORANGE' TO FRUIT.
000180          WRITE IN-RECORD
000190          END-WRITE.
000200      CLOSE DATA-FILE.
000210      STOP RUN.
